Repository: piekarskipiotr/shopping-list-app-flutter
Catalog: lib/l10n/app_*.arb
Languages: pl

# language
source: English
pl: Polski

# test_message
source: Hello {username}
pl: Cześć {username}

# name_error_message
source: Field should contain at least 1 letter and cannot: contain special characters, be empty
pl: Pole powinno zawierać co najmniej 1 literę oraz nie może: zawierać znaków specjalnych, być puste

# amount_error_message
source: Field cannot: contain special characters, be empty, be equal to 0
pl: Pole nie może: zawierać znaków specjalnych, być puste, być równe 0

source: Shopping lists
pl: Listy zakupów

source: Details
pl: Szczegóły

# archived_shopping_lists
source: Archived lists
pl: Zarchiwizowane listy

# shopping_list_adding_dialog_title
source: Add new shopping list
pl: Dodaj nową listę zakupów

source: Shopping list name
pl: Nazwa listy zakupów

# grocery_adding_dialog_title
source: Add new grocery
pl: Dodaj nowy produkt

source: Grocery name
pl: Nazwa produktu

# grocery_amount
source: Amount
pl: Ilość

source: ADD
pl: DODAJ

# empty_list_message
source: List is empty, add something to it :)
pl: List jest pusta, dodaj coś do niej :)

# error_list_message
source: Something went wrong :(
pl: Coś poszło nie tak :(

# offline_message
source: You don't have access to the Internet, it may result in the lack of access to some functions of the application
pl: Nie masz dostępu do internetu, może to spowodować brak dostępu do niektorych funkcji aplikacji

source: Dismiss
pl: Schowaj
